TY	java架构师	
1、8年以上Java应用开发经验，精通Java语言以及J2EE平台特性，熟悉常用的设计模式和开源框架，有大型互联网项目经验或业内知名产品研发经验者优先；
2、精通领域建模能力，能够为复杂业务提供解决方案，有抽象出通用解决业务的能力;
3、精通Oracle、MySQL中的一个，MySQL优先；
4、熟悉Linux环境以及操作，熟悉Tomcat，Apache，Nginx等开源的服务器的配置和调优；
5、熟悉以下技术领域中的若干项，经验丰富者优先：
（1）熟悉分布式系统基础设施中常用的技术，如缓存（Varnish、Redis）、消息中间件(Rabbit MQ、Kafka、RocketMQ)、搜索引擎(Elasticsearch、Lucence）等。
（2）熟悉高并发、高可靠性系统的设计、监控和运维，如负载均衡系统、集群和应用监控、系统容量评估、流量控制、性能优化、故障排查、日志收集和分析等；
（3）熟悉分布式存储和分布式计算，如Hadoop HDFS、FastDFS、HBase、Hive等。
（4）熟悉微服务, 有服务治理的经验，精通SpringCloud技术栈或服务调用框架。
（5）熟悉Docker、虚拟化、弹性计算、自动化运维相关的技术。"

高级java工程师	
1、本科及以上学历，至少5年以上互联网工作经验
2、具有扎实的Java功底，对JVM的原理与调优有丰富的实践经验，具有较好的Java IO、多线程、网络等方面的编程能力；
3、具有较强的架构设计能力，精通常用springcloud,dubbo微服务解决方案
4、熟悉常用关系型数据库：mysql 熟悉常用的NoSQL: Hbase，redis、mongodb，elasticsearch等；
5、有大规模高并发互联网应用的设计和开发经验，有使用mycat等分库分表中间件实际应用经验，
熟悉常规的分布式架构，熟悉缓存、消息队列等开源中间件；
6、有使用openresty，nginx网关方面的开发经验,精通http，tcp协议;
7、高度的责任感和良好的沟通能力、团队管理能力，能适应高强度的工作;"

高级前端工程师
1、五年以上前端开发经验，有良好的工作习惯和积极主动的意识
2. 要求有大中型前端项目的维护、重构经验；
3. 扎实的原生JavaScript 基础，熟练掌握 Vue、React、Angular 任一开发框架；
4. 熟练使用常用的开发工具：git、IDE、Chrome Dev Tool、Postman等；
5. 熟悉浏览器渲染原理以及前端性能优化，对前端的模块化、组件化、工程化有了解，并有实践经验；
6. 熟悉常用数据结构、Http协议；
7. 熟悉Node.js，Nginx，Linux加分；
8. 良好的解决问题能力，能快速搜索未知难题的相关信息、理解并实践出解决方案；
9. 自律自觉、持续学习、积极主动。"

中高级安卓
岗位职责：
1.负责玩吧Android App的开发和维护；
2.负责玩吧Android底层基础模块和整体架构的优化
3.持续的从技术角度提升App易用性，保证App稳定性
4.根据产品设计，进行高质量的软件开发和持续性能优化；
5.解决各种技术难点""
任职要求：
1.本科及以上学历,工作5年以上，熟悉Java语言、Android SDK和NDK，熟悉Android平台体系结构,阅读过Android系统部分源码
2.精通Android App开发，熟练掌握常见的开源框架及其设计原理，优秀的面向对象化编程思想
3.有基础框架设计、公共组件开发、App重构和优化等实践经验，熟练掌握Android 基础框架原理，熟练掌握网络通信机制
4.有多个完整的Android App项目经验，至少参加过一个完整的Android APP的技术框架搭建、关键技术选型工作；
5.有强烈的责任心和团队精神，善于沟通；
6.加分项，有体育相关产品开发经验"""

中高级IOS	
工作职责：
1、负责核心产品迭代改进及移动新产品的开发；
2、产品性能优化；
3、参与性能、体验优化，视频编解码SDK优化；
4、参与客户端基础组件化及分层架构设计；
5、参与Hotfix、React Native、Runtime、数据持久化等技术改造。
任职资格：
1、本科及以上学历,具备3年以上iOS开发经验；
2、具有扎实的Objective-C语言基础，熟练掌握Swift；
3、熟悉常见的数据结构以及设计模式；
4、深入理解UIKit、Core Animation以及Core Graphics等系统框架；
5、深入理解Objective-C Runtime运行机制和内存管理机制；
6、有一定性能调优经验，熟练使用Instruments等性能调优工具；
7、熟悉网络通信机制及常用数据传输协议，具有一定移动网络优化经验；
8、具备良好的学习能力，对新技术有敏锐的嗅觉；
9、具备独立分析并解决问题的能力，能独立承担工作任务；"

golang	
岗位职责：
1、采用Go语言(Golang)开发高可用、高并发的系统引擎、投放端组件、服务；
2、保证系统的效率、可用性以及代码质量和可维护性；
3、参与服务端系统设计;
任职要求：
1、五年以上服务端开发经验，2年以上的GO语言开发经验;
2、熟悉mysql关系型数据库，熟练使用事务、关系型数据库设计原则，sql查询优化，sql索引调优；
3，熟悉Redis、MongoDB、Memcache等nosql技术，熟练使用beego、gin等框架；
4、精通服务器高并发开发，掌握常用的网络架构，有高并发分布式项目经验优先;
5、具有良好的抽象设计能力，思路清晰，善于思考，拥有优秀的分析问题和解决问题的能力，责任心强，具备良好的团队合作精神和承受压力的能力；
6、熟悉Linux平台开发及Shell的编写，熟悉IO、多线程、集群等基础框架，了解Protobuf，Thrift等编码框架；
7、拥用良好的编码规范，有良好的文档编写能力与代码组织能力；
8、有高并发服务开发经验者优先。"

系统集成及技术支持主管	
【岗位职责】：
1. 支撑商业化开放平台对外的对接服务，直接面对客户近距离了解客户诉求和问题，获得解决问题的喜悦，并且帮助进一步完善功能获得的成就感
2、负责售前技术交流，配合市场人员完成项目签单；
3、协助合作伙伴进行技术对接，推进合作伙伴快速集成上线。处理对接中、对接后的各种技术问题，保证合作的正常运行
4、协助商务经理进行需求收集、整理，并反馈给产品经理，推动产品优化更新；
5、通过数据分析，对整体项目部署及流程给出优化建议，分享相关指南以及报告；
6、负责项目对接中相关的技术沟通及问题处理；
7. 有线上流畅英语技术交流能力，文档能力加分。

【任职资格】：
1、  全日制专科及以上学历，六年及以上相关经验；
2、  计算机网络、通信或软件相关专业，具备扎实的专业知识基础，熟悉软件行规等；
3、  有两年以上售前技术方案的撰写及方案设计管理经验，熟悉软硬件集成系统等方案的撰写及设计；
4、  具有较高的综合素质，沟通协调能力及执行力，抗压力能力强,，工作积极主动；
5、  工作有条理性,计划性、亲和力强，办事沉稳细致，有良好的职业道德操守和团队合作意识。
6、  有大型项目集成经验及实施完成案例者优先。"

QA质量保证师	
岗位职责:
1、参与项目过程规范的建立、推广、持续改进，对项目的全过程进行监督，能识别项目风险；
2、负责项目开发过程质量控制，控制研发各阶段的输入、输出，分析、改进相关活动；
3、组织项目相关的技术评审（检查输入文档、组织会议、问题记录、跟踪与落实）；
4、监控项目过程质量，度量项目数据，及时发现项目问题并推动解决；
5、识别项目内部和跨部门的流程问题，进行流程梳理及改进，推动产品质量和效率目标的达成；
6、为项目实施团队提供所需的流程、工具的培训，提供日常的流程相关问题的咨询。

任职资格:
1. 本科及以上学历，计算机、软件工程等相关专业；
2. 三年及以上大型互联网公司SQA工作经验；
3. 熟悉敏捷研发流程，软件生命周期及各阶段流程；
4. 有较强的沟通能力和解决问题的能力；
5. 熟悉质量管理体系，熟悉 ISO 9000\CMMI\scrum 标准，具有一定文档编写能力及项目管理经验；
6. 有深入的过程改进经验，有组织制定部门/项目过程改进活动的成功经验。"

高级运维工程师/运维主管	
1，本科及以上学历，计算机或相关专业，至少5年以上应用运维实战经验；
2，熟悉脚本编程语言Bash、Python中的一种并有相关开发经验；
3，熟悉Docker容器原理和使用、熟悉镜像制作与管理，熟悉Kubernetes、Swarm等容器编排工具使用，有生产环境实践经验者优先；
4，熟练掌握主流应用服务器架构体系、数据库以及各种中间件技术；（LVS/Nginx/Haproxy/Tomcat/MySQL/DNS/Redis/Kafka/MongoDB/Hadoop生态圈等），对运维体系有深入的研究和理解；
5，熟悉HTTP/HTTPS、TCP/IP等常见协议（栈）；
6，熟悉常用的批量操作工具Ansible、Saltstack，Puppet中至少一种；
7，熟悉常用的监控系统，如 Zabbix、Prometheus 或Open-falcon等；
8，熟悉日志搜索与分析工具，如ELK Stack；
9，熟悉Jenkins，对CI/CD流程有实践经验；
10，熟悉KVM虚拟化原理与使用；
11，精通分布式调用链监控（Zipkin、Cat、Pinpoint等）或微服务管理优先；
12，具备良好的系统分析能力，良好的抽象思维和逻辑思维能力，独立分析问题解决问题的能力；
13，可承受较大压力，有责任感，较强的沟通协调能力，具有团队合作精神,能带领团队进行主要平台产品的研发和平台升级优化；
14，关注开源云产品和国内外相关前沿技术发展，在开源社群活跃并有积极贡献者优先。"

产品副总监	
1、10年以上产品经验，有丰富的大厂经验，有团队管理经验，有丰富的客户端经验优先;
2、熟悉用户心理，制订可行的产品方案并有效的执行，对相关策略有独到见解的优先；
3、有一定的数据分析能力和语言、沟通、组织协调能力；
4、具备较强责任心和团队精神，乐于接受挑战，勇于突破创新，工作认真细致，善于调动团队积极性，主动积极推动达成业务目标；"

产品经理	
1、3年以上产品经验，有团队管理经验者优先;
2、熟悉用户心理，制订可行的产品方案并有效的执行，对相关策略有独到见解的优先；
3、有一定的数据分析能力和语言、沟通、组织协调能力；
4、具备较强责任心和团队精神，乐于接受挑战，勇于突破创新，工作认真细致，善于调动团队积极性，主动积极推动达成业务目标；"

UI设计师	
工作职责：
1、负责体育游戏产品相关的界面设计、图标设计；
2、制定产品相关规范，驱动产品的交互和视觉设计保持一致性、标准化；提高产品的可用性、优化设计提升产品体验；
3、参与产品需求设计讨论，配合开发完成界面设计，跟踪产品效果，保证最终设计质量；
4、关注产品数据，具备一定的产品思考和设计能力；
5、关注设计趋势，分享设计经验，推动提高团队的设计能力;
6、本科及以上美术院校，设计类相关专业;
任职资格：
1、有3年以上的互联网或移动互联网领域的UI设计工作经验;
2、对用户体验设计和产品有一定的见解，可以清晰表达自己的设计思考;
3、熟悉Android、iOS等系统特性及官方设计规范，精通sketch、ps等软件的使用；"

UE交互设计师	
工作职责：
1、负责体育游戏产品平台产品及新业务的交互体验把控，提升产品的一致性，易用性，品牌价值；
2、理解产品的战略意义，提出符合公司层级的产品解决方案并推进落地；
3、能够与产品，研发团队紧密配合，确保上线产品体验质量；
4、推进组织部门的大型项目，并对团队效能进行迭代优化；
5、推进公司整体对用户体验和交互设计的认知;
6、全日制统招本科以上学历，工业设计、计算机、心理学等相关专业优先；

任职要求
1、5年以上的互联网、软件行业交互设计工作经验，熟悉互联网产品设计相关流程，并有成功案例；
2、极强的逻辑思考能力，对用户体验和易用性有敏锐的把握能力；
3、熟练运用体验设计各种方法，对交互设计理论有较深的了解和认识；
4、有较强的沟通和执行能力，在协作中能不断加强自身作为设计师的影响力，以不倦的传道精神将设计理论灌输于产品的实现中；
5、对设计和创新有自己独到的见解和驾驭能力，对行业趋势和大局发展亦有自己的观察和把控，并将之转化为行职资格："

高级测试工程师	
1，计算机相关专业，本科及以上学历，5年以上产品测试工作经验；
2，负责过大型的项目测试工作，有过5人以上团队管理经验；
3，熟悉测试流程和规范，熟练掌握软件测试方法，熟悉黑盒测试、安全测试、自动化测试、性能测试等；
4，熟练使用任意一种常用的自动化测试工具（QTP、LoadRunner、Selenium、Jmeter等），缺陷管理跟踪软件（禅道、Jira、QC）；
5，良好的开发基础，熟练使用一种或多种开发语言（python、Java、Go或其他脚本语言），有搭建自动化测试平台的实战经验者优先；
6，熟练使用 版本控制工具，熟悉任意一种数据库，熟练编写sql；
7，较强的表达沟通能力、团队合作精神，工作细致、责任心强，较强的逻辑分析总结能力和学习能力；
8，有管理团队经验，能够规划、指导测试工程师工作。"

DBA	
1，本科及以上学历，十年以上数据库架构、设计经验，有一定开发基础，有丰富的专业领域知识。
2，精通关系数据库模型，并对非关系型数据库模型也有所了解。
3，精通多种主流数据库如Mysql、Redis等，并熟悉其他NoSQL及NewSQL数据库，如Redis、Cassandra、TIDB等。
4，熟悉不同数据库、不同平台的优势、劣势，并能科学地作出决策。
5，熟悉操作系统（Linux）、存储、网络技术，并对虚拟化、云等有所了解。
6，熟悉主流软件架构，了解多种开发语言并至少掌握一门作为开发语言，有一定的开发能力
7，具备敏锐的技术前瞻性。
8，具有良好的沟通、协调能力，能承受较大的工作压力。
9，对于复杂问题，具有很强的分析判断和解决能力。
10，对于新技术具有很强的学习能力。
11，具有完备的方案编写能力。"

资深风控	
1、负责风险控制管理中心及各分公司风控人员的工作管理、监督、指导、培训及团队建设
2、本科及以上学历，5年体育博彩经验，爱好体育和电竞，有意向做风控主管和运营主管，35岁以内；
3、熟悉会员特性
4、分析和表达能力强，逻辑思维清晰
5、善于沟通，虚心受教"

网络工程师	
职责描述：
1、 负责公司IDC机房的网络架构的设计、优化、部署及网络运维管理体系的构建；
2、 负责公司网络规划，部署及维护工作；
3、 负责总部到分公司办公室网络的路由、安全策略、可用性等设计及维护工作；
4、 负责网络管理系统的设计、实现；
5、 负责机房及网络相关故障、疑难问题排查、分析及处理；
6、 负责制定网络运维管理制度、运维手册等文档
 
任职要求：
1、计算机或相关专业本科以上学历，3年以上IT网络建设及运维工作经验；
2、熟悉Cisco等主流网络设备的配置与故障处理；
3、具有高度的责任心，有较强的学习能力和沟通能力,能独立完成网络相关运维工作；
5、有丰富的网络故障排错经验，能迅速定位并排查问题，有较强的网络抓包、日志分析、网络测试等排错能力；
6、具有CCIE\HCIE等高级网络证书者或具备大型网络规划经验者优先；"

IT运维工程师	
职责描述：
1、 负责公司日常办公网络、系统、软件的安装及维护；
2、 负责办公区的内部网络设备24小时运维监控，及时响应和排除故障；
3、 负责桌面维护，处理日常的桌面电脑故障及权限管理；
4、 协助办公网络设备选型、安装等相关运维工作；
5、 完成办公网络安装、维护、及故障处理的技术文档编写；
6、 主管安排的其他工作。
 
任职要求：
1、 大专以上学历，计算机、通信、电子相关专业；
2、 1年以上办公网络维护及运维或办公室IT技术服务经验，有一定的安装、故障排查能力；
3、 良好的计算机软硬件基础知识、熟悉网络基础知识、了解主流厂商的网络产品，熟悉常见的办公网络及桌面维护的故障问题及处理办法；
4、 良好的沟通表达能力，良好的服务意识，做事认真负责，能吃苦耐劳；
5、 有一定的抗压性，乐于新技术新问题的钻研和探索，良好的学习能力；
6、 有CCNA及以上认证者及办公桌面维护经验者优先；
 "
体育编辑	
1. 负责体育赛事的后台运营，编辑，翻译等，完善相关信息；
2. 赛事审核，以及问题反馈；
3. 具备基础英语水平，独立查询搜集国际赛事，信息核对；
4. 工作细致，学习力佳，具备体育相关或BC经验者优先；
5. 统招大专及以上学历；"
	
资深操盘手	
1. 大专及以上学历，35岁以下男女不限。
2. 熟悉各大体育赛事，对主流大联赛有自己独特的见解。
3. 熟悉体育比赛的盘口，水位以及多种玩法，有1-3年或以上相关操盘经验。（可接受在菲）
4. 逻辑思维强，对数字敏感，对市场有敏锐的观察力以及处理紧急情的应变能力。
5. 熟悉了解风控的流程，对风控的事件有一定的敏锐度。
6. 学习能力强，能服从公司和上级安排。"

初/中级操盘手	
1 年龄到22-35岁之间，高中以上学历
2 2年以上的操盘经验，
3 可接受应届毕业生，理工科背景，逻辑思维强，可培养性强。"
